<a href="https://colab.research.google.com/github/JakeOh/202105_itw_bd26/blob/main/lab_da/da08_read.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 파일을 읽고 DataFrame 생성하기

* csv, tsv
* txt
* xls, xlsx
* ...

In [1]:
import pandas as pd

In [2]:
ex1_path = 'https://github.com/wesm/pydata-book/raw/2nd-edition/examples/ex1.csv'

In [3]:
ex1 = pd.read_csv(ex1_path)

In [4]:
ex1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

`read_csv` 함수는 CSV 파일의 첫번째 줄을 데이터가 아니라 컬럼 이름으로 해석.

In [5]:
ex1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   a        3 non-null      int64
 1   b        3 non-null      int64
 2   c        3 non-null      int64
 3   d        3 non-null      int64
 4   message  3 non-null      object
dtypes: int64(4), object(1)
memory usage: 248.0+ bytes

`read_csv` 함수는 변수의 타입을 숫자로 변환할 수 있는 경우(문자열 -> 정수, 문자열 -> 실수)에 자동으로 변환함.

In [6]:
ex1_xlsx_path = 'https://github.com/wesm/pydata-book/raw/2nd-edition/examples/ex1.xlsx'

In [7]:
ex1_xlsx = pd.read_excel(ex1_xlsx_path)

In [8]:
ex1_xlsx

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [9]:
ex1_xlsx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  3 non-null      int64
 1   a           3 non-null      int64
 2   b           3 non-null      int64
 3   c           3 non-null      int64
 4   d           3 non-null      int64
 5   message     3 non-null      object
dtypes: int64(5), object(1)
memory usage: 272.0+ bytes

`read_excel` 함수는 파일의 첫번째 row를 컬럼 이름으로 생각함.
파일의 첫번째 column을 행 번호(인덱스)로 간주하지는 않음.
만약 특정 컬럼이 데이터가 아니라 행 번호인 경우 index_col 파라미터를 사용해서 제거할 수 있음.

In [10]:
ex1_xlsx = pd.read_excel(ex1_xlsx_path, index_col=0)

In [11]:
ex1_xlsx

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
ex2_path = 'https://github.com/wesm/pydata-book/raw/2nd-edition/examples/ex2.csv'

첫번째 라인에 컬럼 이름이 없이 바로 데이터가 시작되는 CSV 파일

In [13]:
ex2 = pd.read_csv(ex2_path)

In [14]:
ex2  #> 파일의 첫번째 줄의 내용이 컬럼 이름이 되어 버림.

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [18]:
ex2 = pd.read_csv(ex2_path, names=['a', 'b', 'c', 'd', 'message'])
ex2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

* names 파라미터에 값이 전달되지 않는 경우, header 파라미터의 값은 0.
    * 파일의 첫번째 줄(0번 인덱스 라인)이 컬럼 이름(헤더)가 됨.
* names 파라미터에 값이 명시적으로 전달되는 경우, header 파라미터 값은 None.
    * 파일에서 header로 사용되는 줄이 없음.